---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint.Station
source: html/e587e77b-0484-2f28-d9e4-d3fea9998bd7.htm
---
# Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint.Station Property

The endpoint's station value.

## Syntax (C#)
```csharp
public double Station { get; internal set; }
```